title: Test_Rule
status: experimental
description: Malware often uses well-known windows process names for their malicious process name to avoid detection. This technique is called masquerading.
references:
    - https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/masquerading_files.txt
    - https://niiconsulting.com/checkmate/2017/08/threat-hunting-for-masquerading-windows-processes/
    - https://patrick-bareiss.com/detecting-masquerading-of-malware-with-sigma/
tags:
    - attack.defense_evasion
    - attack.t1036
author: Patrick Bareiss
date: 2019/04/17
logsource:
    product: windows
    service: security
detection:
    selection:
        EventCode: 4770
    condition: selection
fields:
    - EventCode
    - ComputerName
    - Type
falsepositives:
    - unknown
level: critical

